<script setup>
import MarkdownIt from 'markdown-it';

const markdownIt = new MarkdownIt()

const markdownText = `
# 项目背景

我省拥有三江源、祁连山、青海湖等国家公园，目前，基本形成了以国家公园为主体的新型自然保护的体系，每年都采集了大量的针对相关区域的数据，例如林地、草地、湿地以及相关冰川、保护物种等的数据，如何基于这些数据形成对国家公园的数据分析及预测，有效保障人与自然的平衡发展，是当前生态大数据分析以及人工智能应用技术的一个重点方向。我公司基于以上思考，研发了国家公园态势感知系统，利用大数据、云计算、机器学习等前沿技术，激活每年沉淀的调查数据，实现国家公园的宏观态势感知。

需解决的主要技术难题
1. 海量数据的存储：要全面实现国家森林公园的态势感知，需从多个空间、时间维度获取相关的数据，为此需要研究大量数据的归类、统计方法，形成科学合理、完整的数据库。
2. 模型建设：本系统需要将机器学习、神经网络以及各种生态模型进行整合，实现国家公园态势评价以及关键点的分析、预警，为此需要结合数据库建设、数据分析技术及信息系统开发技术，完成相关模型的建设和训练。

# 项目目标

本子项目的目标是实现国家公园的态势感知，实现基于公园的人口总户数、总人数及种植户的户数及人数变化情况，建立公园的人类活动态势感知模型，实现对公园的人类活动态势的实时监测、分析、预警。
同时实现一套功能完善的数据管理面板，实现对公园的人口数据、种植户数据、人类活动数据的管理、分析、展示等功能。

# 团队介绍

本项目团队由武汉理工大学三亚科教园的研究生组成，团队成员有刘江、李成龙，团队导师为龚腾飞老师。开发时长为两周，项目开发周期为 2024年6月24日至2024年7月4日。

# 核心技术

本项目使用了以下技术：

- 前端模块：Vue3 + Vite2 + Naive UI
- 后端模块：SpringBoot + MyBatis + MySQL
- 人工智能模块：基于时间序列分析模型的人口预测模型、基于变点检测模型的人口数量预警模型
`
</script>

<template>
  <div class="container">
    <div v-html="markdownIt.render(markdownText)"></div>
  </div>
</template>

<style scoped>
.container {
  padding: 20px;
}
</style>